Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: རྣམ་པ་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཚུལ་གྱི་རྗེས་སུ་འབྲང་བའི་སྐལ་པ་མཉམ་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཤེས་ཤིང་ཁོང་དུ་ཆུད་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར།
en: the commonality of following a way for attaining all aspects of the illumination of the path for entering an ocean of the ways of omniscience; the commonality of the comprehension of meaning for attaining the comprehension of the nature of all phenomena;

source: དོན་ཁོང་དུ་ཆུད་པའི་སྐལ་པ་མཉམ་པ་དང་། ཆོས་ཀྱི་ཚུལ་རྒྱ་ཚོ་ཐམས་ཅད་ལ་ཆོས་ལ་རྣམ་པར་སྤྱོད་པའི་སྐལ་བ་མཉམ་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པར་གཏོར་པའི་ཕྱིར་མི་འཇིགས་པའི་སྐལ་བ་མཉམ་པ་དང་། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བ་རྣམས་ལ་རྣམ་པ་ཐ་དད་པར་ཡོངས་སུ་བསྟན་པའི་མཚན་དང་དཔེ་བྱད་བཟང་པོས་རྣམ་པར་བྲིས་པའི་ལུས་རྣམ་པར་དག་པར་རབ་ཏུ་ཐོབ་བར་བྱ་བའི་ཕྱིར་གཟུགས་ཀྱི་ལུས་རྣམ་པར་དག་པའི་སྐལ་པ་མཉམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཡོངས་སུ་རྫོག་ས་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམྱིགས་པ།
en: the commonality of Dharma practice for the destruction of the mountain of all obscurations; the commonality of a pure form body for attaining a pure body adorned by signs and features of a great being that are manifested separately to beings according to their wishes; the commonality of strength for the increase of focusing on omniscience through perfecting the strength of a bodhisattva; the commonality of fearlessness for the purification of the space of mind and thoughts; the commonality of diligence for attaining the unwearying continuation of bodhisattva conduct throughout all kalpas; the commonality of eloquence for attaining the illumination of the unobscured knowledge of all Dharma; the commonality of being unsurpassable for the purification of a body superior to all beings; the commonality of undaunted, intrepid speech for the purification of words that bring joy to all circles of followers; the commonality of sound for expressing the ocean of sound of the ways of all the Dharma;

source: རྣམ་པར་འཕེལ་བར་བྱ་བའི་ཕྱིར་སྟོབས་ཀྱི་སྐལ་བ་མཉམ་པ་དང་། སེམས་དང་བསམ་པའི་ནམ་མཁའ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མི་འཇིགས་པའི་ཕྱིར་མྱི་འཇིག་པའི་སྐལ་བ་མཉམ་པ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པས་མྱི་སྐྱོ་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱི་སྐལ་བ་མཉམ་པ་དང་། ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མྱེད་པའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྤོབས་པས་སྐལ་པ་མཉམ་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་ལུས་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཟིལ་གྱིས་མྱི་ནོན་པའི་སྐལ་པ་མཉམ་པ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་མངོན་པར་དགའ་བར་བྱ་བའི་ཚིགས་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མ་ཞུམ་མྱི་དམའ་བའི་སྐལ་བ་མཉམ་པ་དང་། ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་སྒྲ་རབ་ཏུ་བསྒྲག་པའི་ཕྱིར་དབྱངས་ཀྱི་སྐལ་བ་མཉམ་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཚིག་རྣམ་པར་དམྱིགས་པའི་ཐ་སྙད་དང་། ཚུལ་རྒྱ་མཚོ་ལ་དབྱངས་ཀྱི་ཡན་ལག་རྣམ་པར་དག་པའི་སྐལ་བ་མཉམ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གདམས་ངག་གི་ཡོན་ཏན་ཁོང་དུ་ཆུད་པ་རྣམ་པར་དག་པར་བྱ་བ་ལ་ཡོན་ཏན་རྣམ་པར་དག་པའི་སྐལ་བ་མཉམ་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་རྣམ་པར་སྨྱིན་པ་ཡོགས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་དང་ལས་ཀྱི་རྒྱུད་དུ་མི་འགལ་བའི་སྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་བྱུང་བ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་ཕྱིར་མཆོད་སྦྱིན་གྱིས་ཆོས་བཟང་པོ་ལ་རབ་ཏུ་གནས་པའི་སྐལ་བ་མཉམ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་དང་ཡེ་ཤེས་ལ་ཡང་དག་པར་གནས་པར་བྱ་བའི་ཕྱིར།
en: the commonality of the pure aspects of the voice in the ocean of the ways and terms used in the words of all beings; the commonality of the pure qualities in the pure realization of the qualities of the teaching of the tathāgatas; the commonality of not being in contradiction with the lineage of Dharma and karma for the pure ripening of karma without transgressions; the commonality of being established on the level of good Dharma through Dharma generosity for the turning of the Dharma wheel of all buddhas that have appeared; the commonality of pure celibacy for remaining in the knowledge and field of all the tathāgatas;

source: ཚངས་པའི་སྤྱོད་པ་རྣམ་པར་དག་པའི་བསྐལ་བ་མཉམ་པ་དང་། བྱམས་པའི་ཚུལ་སྣ་ཚོགས་ཀྱིས་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་དུ་རྒྱས་པར་དགང་བར་བྱ་བའི་ཕྱིར་བྱམས་པ་ཆེན་པོའི་སྐལ་བ་མཉམ་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབས་པའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆེར་མངོན་པར་དབབ་པའི་ཕྱིར།
en: the commonality of great kindness for spreading in each instant, through various ways of kindness, throughout the ocean of all beings; the commonality of entering the ocean of the ways of great compassion of sending down a rain of the Dharma that protects all realms of beings; the commonality of activity of the body for having the same existence as all beings as a method for ripening them; the commonality of activity of the speech for speaking and communicating the Dharma;

source: སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པའི་སྐལ་བ་མཉམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱེད་པའི་ཐབས་ཀྱི་རྒྱུད་དུ་སྐལ་བ་མཉམ་པར་བྱ་བའི་ཕྱིར་ལུས་ཀྱི་ལས་ཀྱི་སྐལ་བ་མཉམ་པ་དང་། ཆོས་ཐམས་ཅད་བརྗོད་ཅིང་སྨོས་པ་ལ་ངག་གི་ལས་རྣམ་པར་དག་པའི་སྐལ་བ་མཉམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམིགས་པ་ཉེ་བར་བསྒྲུབ་པའི་ཕྱིར་ཡིད་ཀྱི་ལས་ཀྱི་སྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ལ་རྒྱན་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བརྒྱན་པའི་སྐལ་པ་མཉམ་པ་དང་། སངས་རྒྱས་འབྱུང་བ་རྒྱ་མཚོ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱན་སྔར་འགྲོ་བའི་སྐལ་བ་མཉམ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གསོལ་བ་གདབ་པའི་སྐལ་བ་མཉམ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་དུས་མ་ལུས་པར་མཆོད་པ་ཐམས་ཅད་ཀྱིས་རིམ་གྲོ་བྱ་བའི་ཕྱིར།
en: the commonality of activity of the mind for instilling a focus on omniscience in the minds of all beings; the commonality of the beautification of all various displays within all buddha realms for approaching the presence of all tathāgatas; the commonality of approaching their presence within the ocean of all buddhas that have appeared; the commonality of requesting all tathāgatas to turn the wheel of the Dharma; the commonality of serving through offerings all tathāgatas throughout all times without exception;

source: མཆོད་པས་རིམ་གྲོ་བྱ་བའི་སྐལ་བའི་མཉམ་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་དུ་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བའི་སྐལ་པ་མཉམ་པ་དང་། ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ལ་སྣང་བ་རབ་ཏུ་ཐོབ་པའི་སྐལ་བ་མཉམ་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པའི་སྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། རྣམ་པར་འཕྲུལ་པས་རྒྱས་པར་དགང་པའི་ཕྱིར་ཀུན་ཏུ་རྒྱས་པར་དགང་བའི་སྐལ་བ་མཉམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་ཚུལ་རྒྱ་མཚོ་ལ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་སྤྱོད་པའི་སྐལ་པ་མཉམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་ལ་འཁོར་གྱི་སྐལ་བ་མཉམ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཤིན་ཏུ་ཕྲ་བར་འཇུག་པ་ལ་འཇུག་པའི་སྐལ་པ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཤིན་ཏུ་ཡངས་པ་ཐམས་ཅད་དུ་སེམས་རྣམ་པར་ཕྱེ་བའི་བསྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པ་རྣམ་པ་ཐ་དད་པ་ཁོང་དུ་ཆད་པར་བྱ་བ་ལ་ཁོང་དུ་ཆུད་པ་རྣམ་པ་ཐ་དད་པའི་སྐལ་པ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྣམ་པར་ཕྱེ་བ་ཡེ་ཤེས་མཐའ་ཡས་པས་རྣམ་པར་དམྱིགས་པར་བྱ་བ་ལ་ཚུལ་འབྱམ་ཀླས་པས་ཀུན་ཏུ་རྒྱས་པར་དགང་བའི་སྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་མངོན་པར་འབྱུང་བའི་སྐལ་བ་མཉམ་པ་དང་ཕྱོགས་ཐམས་ཅད་རྒྱས་པར་དགང་བ་ཡང་དག་པར་གཞོལ་པ་ཐོགས་པ་མེད་ཅིང་ཕྱིར་མྱི་ལྡོག་པར་བྱ་བའི་ཕྱིར་ཕྱིར་མི་ལྡོག་པའི་སྐལ་པ་མཉམ་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཏུ་རྣམ་པར་འཚང་རྒྱ་བའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་མུན་པ་རྣམ་པར་སེལ་བའི་སྐལ་པ་མཉམ་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོར་རྗེས་སུ་ཕྱིན་པའི་སྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་སྦྱོར་བ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ལུས་ཀྱི་དྲ་བས་རྒྱས་བར་དགང་བའི་སྐལ་བ་མཉམ་པ་དང་། ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་རྗེས་སུ་རྒྱུ་བ་དེ་དང་དེ་དག་ལ་ཡེ་ཤེས་མངོན་སུམ་གྱི་སྐལ་བ་མཉམ་པ་དང་། རྗེས་སུ་མཐུན་པའི་ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་མངོན་དུ་བྱ་བའི་སྦྱོར་བ་ལ་ནན་ཏན་གྱི་སྐལ་བ་མཉམ་པ་དང་། ཆོས་ཀྱི་མོས་པ་ཤིན་ཏུ་ཤས་ཆེ་བའི་བརྩམ་པ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་བཙལ་བའི་སྐལ་བ་མཉམ་པ་དང་། ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་རྒྱན་ཡོངས་སུ་བསྒྲུབ་པ་ལ་རྣམ་པར་དག་པའི་སྐལ་བ་མཉམ་པ་དང་། ཉམ་ང་བའི་རྟོག་པ་མེད་པའི་སེམས་ཀྱི་དཀྱིལ་འཁོར་གྱིས་ཆོས་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཡིད་ཀྱི་བསྐལ་བ་མཉམ་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་ཚོགས་ཡང་དག་པར་བརྩམས་པ་མཐར་ཕྱིན་པར་བྱ་བའི་སྦྱོར་བ་ལ་བརྩོན་འགྲུས་བརྩམས་པའི་སྐལ་བ་མཉམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་སྤྱོད་པའི་རྒྱན་གྱི་སྐལ་བ་མཉམ་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་མཚན་མ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཆགས་པ་མེད་པ་རྣམ་པར་སྤྱད་པའི་སྐལ་བ་མཉམ་པ་དང་། ཆོས་ལ་རྣམ་པར་སྤྱོད་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་འཕྲུལ་པ་དེ་དང་དེ་དག་ཏུ་ཐབས་མཁས་པའི་ཚུལ་གྱི་སྐལ་བ་མཉམ་པ་དང་། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཡུལ་བསྟན་པས་ཡང་དག་པར་བསྐུལ་བའི་ཕྱིར་སྐྱེ་མཆེད་རྣམ་པར་དག་པའི་སྐལ་པ་མཉམ་པ་དང་། ཆོས་ཐམས་ཅད་བསྒོམ་པ་དང་། རྣམ་པར་བསྒོམ་པར་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་སྐལ་བ་མཉམ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་སྐལ་པ་མཉམ་པ་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་ཐོབ་པར་བྱ་བ་ལས་ཡོངས་སུ་གནན་པའི་སྐལ་བ་མཉམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དགོད་པ་ཐམས་ཅད་ལ་རབ་ཏུ་གནས་པའི་སྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ལུང་བསྟན་པ་ལ་ཡོངས་སུ་བསྟན་པའི་སྐལ་པ་མཉམ་པ་དང་། སྐད་ཅིག་གཅིག་གི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོའི་ཚུལ་ཐམས་ཅད་ལ་ཏིང་ངེ་འཛིན་གྱི་སྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་མཚན་ཉིད་སྣ་ཚོགས་ལ་ཏིང་ངེ་འཛིན་རྣམ་པར་དགོད་པའི་སྐལ་བ་མཉམ་པ་དང་། རྗེས་སུ་དྲན་པའི་དམྱིགས་པའི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྗེས་སུ་དྲན་པའི་སྐལ་བ་མཉམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བྱ་བ་ལ་ཕྱི་མའི་མཐའི་བསྐལ་བའི་མུར་ཐུག་པར་ཞེ་ནོན་པ་ལ་བྱང་ཆུབ་སེམས་དཔས་སྤྱད་པའི་སྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཚད་མེད་པ་ལ་མོས་ཤིང་དགའ་བའི་ཤུགས་རྒྱ་མཚོ་རྣམ་པར་འཕེལ་བར་བྱ་བའི་ཕྱིར་མོས་པའི་སྐལ་བ་མཉམ་པ་དང་། སྒྲིབ་པའི་རི་ཐམས་ཅད་ལ་རྣམ་པར་བཟློག་པའི་སྐལ་བ་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཚོགས་མཐའ་ཡས་པ་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར།
en: the commonality of the guidance that ripens all beings within all realms of beings; the commonality of attaining the illumination of all the ways of the Dharma; the commonality of attaining samādhi in the entire ocean of the ways of samādhi; the commonality of pervasion for pervading the entire ocean of buddha realms with all the miraculous manifestations and conduct of bodhisattvas; the commonality of bodhisattva conduct within the ocean of all the miraculous manifestations of bodhisattvas; the commonality of followers in the maintenance of all bodhisattva conduct; the commonality of entry in entering all the most subtle world realms; the commonality of distinctions of motivation in the vastness of all buddha realms; the commonality of the different kinds of approaching in approaching the various kinds of entry into the ocean of all buddha realms; the commonality of pervading the extent of every kind of way in the perception of the infinite knowledge of the categories of all buddha realms; the commonality of arising in all buddha realms; the commonality of irreversibility for irreversibly and without impediment spreading throughout and remaining in all directions; the commonality of eliminating darkness for attaining the illumination of the domain of wisdom of the enlightenment at the bodhimaṇḍas of all buddhas; the commonality of following in the ocean of the circles of followers of all buddhas; the commonality of a spreading network of bodies in all the buddha realms in dedication to offering and service to tathāgatas in countless buddha realms; the commonality of direct knowledge in constant engagement with the ocean of the ways of the Dharma; the commonality of practice in appropriate engagement with all the ways of the Dharma; the commonality of seeking the purification of undertakings made with an intense aspiration for the Dharma; the commonality of purity in accomplishing the adornment of the qualities of buddhahood through the activities of body, speech, and mind; the commonality of mind for the purification of the domain of the knowledge of all Dharmas by the domain of mind that is free of fearful thoughts; the commonality of diligent undertakings in engagement in bringing to its conclusion the undertaking of the accumulation of all roots of merit; the commonality of the display of conduct in the practice of all bodhisattva conduct; the commonality of practice without impediment in the comprehension of the attributes of all Dharmas; the commonality of the way of skillful methods in the miraculous manifestations here and there through the knowledge of the practice of the Dharma; the commonality of pure āyatanas in manifesting a field of sensory perception in accordance with the wishes of beings; the commonality of the attainment of the gateways to bodhisattva samādhi within the attainment of meditation on and cultivation of all Dharmas; the commonality of empowerment in the abodes of all the tathāgatas; the commonality of reaching the bhūmis on attaining all the bhūmis of the buddhas and bodhisattvas; the commonality of abode in the establishment of all bodhisattvas; the commonality of revelation in the prophecies of all the buddhas; the commonality of samādhi in an ocean of samādhis in each instant; the commonality of being established in samādhi within the various characteristics of the activities of the buddhas; the commonality of mindfulness in the ocean of all the ways of being focused on mindfulness; the commonality of bodhisattva conduct in being dedicated to bodhisattva activities until the last of future kalpas; the commonality of aspiration for increasing the ocean of the power of delight in aspiring to the immeasurable knowledge of buddhahood; the commonality of repelling the mountain of all obscurations; the commonality of irreversible knowledge that accomplishes the infinite accumulation of the knowledge of the buddhas; the commonality of taking birth in the times for ripening and guiding all beings; the commonality of practice in the gateways to the ways of omniscience; the commonality of scope in entering the scope of supremacy in the ways of the realm of the Dharma; the commonality of being unbased in order to have a mind that has eradicated all bases;

source: ཕྱིར་མྱི་ལྡོག་པའི་ཡེ་ཤེས་ཀྱི་སྐལ་བ་མཉམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བའི་དུས་སུ་སྐྱེ་བའི་སྐལ་པ་མཉམ་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚུལ་གྱི་སྒོ་ལ་རྣམ་པར་སྤྱོད་པའི་སྐལ་པ་མཉམ་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་གྱིས་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བའི་ཡུལ་ལ་རབ་ཏུ་འཇུག་པར་བྱ་བའི་ཕྱིར་ཡུལ་གྱི་སྐལ་པ་མཉམ་པ་དང་། གཞི་ཐམས་ཅད་ཡོངས་སུ་ཆོམས་པའི་སེམས་སུ་བྱ་བའི་ཕྱིར་གཞི་མེད་པའི་སྐལ་བ་མཉམ་པ་དང་། ཆོས་མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་པའི་སྐལ་པ་མཉམ་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་རང་གི་ལུས་ཀྱིས་ཡང་དག་པར་གནོན་པའི་ཕྱིར་བརྩོན་པའི་སྐལ་བ་མཉམ་པདང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ནན་ཏན་གྱི་ཚུལ་ལ་མངོན་པར་ཤེས་པའི་སྐལ་བ་མཉམ་པ་དང་། ཕྱོགས་ཐམས་ཅད་ཀྱི་ཞིང་རྒྱ་མཚོ་འཇུག་པར་བྱ་བ་ལ་མངོན་པར་འདུ་བྱ་བ་མྱེད་པའི་རྫུ་འཕྲུལ་རབ་ཏུ་ཐོབ་པའི་སྐལ་བ་མཉམ་པ་དང་། གཟུངས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བ་ལ་གཟུངས་ཀྱི་སའི་སྐལ་པ་མཉམ་པདང་། མདོ་སྡེའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཐམས་ཅད་ལ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་དགོངས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྐལ་བ་མཉམ་པ་དང་། ནམ་མཁའི་དབྱིངས་ལྟ་བུའི་ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་ཆོས་ཟབ་མོ་ལ་འཇུག་པའི་སྐལ་བ་མཉམ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་སྣང་བར་བྱ་བའི་སྐལ་བ་མཉམ་པ་དང་། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བས་རྣམ་པར་དམིགས་པར་བསྟན་པ་ལ་མངོན་པར་གསལ་བའི་སྐལ་བ་མཉམ་པ་དང་། ཞིང་གི་བྱིན་གྱི་རླབས་དང་། རྣམ་པར་འཕྲུལ་པ་སེམས་ཅན་ཡོངས་སུ་བསྟན་པའི་ཕྱིར་རབ་ཏུ་སྐྱོད་པའི་སྐལ་བ་མཉམ་པ་དང་། མཐོང་བ་དང་ཐོས་པ་དང་། རྗེས་སུ་དྲན་པས་སེམས་ཅན་འདུལ་བའི་ཕྱིར་དོན་ཡོད་པར་སྤྱད་པའི་སྐལ་བ་མཉམ་པ་དང་། སྨོན་ལམ་རྒྱ་མཚོའི་ཚུལ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པས་སྟོབས་བཅུའི་ཡེ་ཤེས་རྗེས་སུ་འཚང་རྒྱ་བར་བྱ་བའི་ཕྱིར་འབྱུང་བའི་སྐལ་བ་མཉམ་པ་ཡང་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: the commonality of the teaching of the Dharma for entering into the knowledge of the equality of all phenomena; the commonality of application for the body acquiring the empowerment of all the buddhas; the commonality of higher cognition in the ways of practicing gaining knowledge of all worlds; the commonality of attaining miraculous powers without karmic accumulation in entering the ocean of realms in all directions; the commonality of the level of mental retention for attaining the illumination of an ocean of all retentions; the commonality of comprehending the intention of the Dharma wheels of the buddhas within the transmission of the sūtras; the commonality of comprehending the profound Dharma in comprehending the ways of the Dharma that are as vast as space; the commonality of illumination in the extent of all world realms; the commonality of brilliance in manifesting to the perception of beings in accordance with their aspirations; the commonality of shaking in manifesting to beings blessings and miraculous manifestations in the worlds; and the commonality of meaningful conduct in guiding beings through being seen, heard, or remembered; and he attained the commonality of setting forth for the awakening of the knowledge of the ten strengths, which fulfills all the ways of an ocean of prayers.

source: །དེ་ལྟར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཤིན་ཏུ་དགའ་བའི་སེམས་སུ་གྱུར་ཏེ།
en: In that way, Sudhana, the head merchant’s son, gained a state of delight.

source: མཚན་མོའི་ལྷ་མོའི་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ལ་བལྟས་པས་འདུ་ཤེས་རྣམ་པར་དག་པ་ཐོབ་པར་གྱུར་ཏེ།
en: He attained those pure perceptions through looking at the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā.

source: འདི་དག་ལ་སྩོགས་པ་མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ལས་སྐལ་བ་མཉམ་པའི་ཚུལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་ཐོབ་པར་གྱུར་ཏོ།
en: He attained these and other commonalities, as numerous as the atoms in a buddha realm, from the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ལས་བལྟ་བའི་ཚུལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་ཞུགས་པ་དགེ་བའི་བཤེས་གཉེན་གྱི་འདུ་ཤེས་རྣམ་པར་དག་པ་མཐའ་དང་དབུས་མེད་པ་རབ་ཏུ་ཐོབ་པ་སྐལ་བ་མཉམ་པའི་ཚུལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པ་ལ་ཞུགས་པས་བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ཏེ།
en: Sudhana, the head merchant’s son, because of the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā, entered ways of seeing that were as numerous as the atoms in a buddha realm; he attained pure perceptions, without end or center, of the kalyāṇamitras; and he entered ways of commonality that were as numerous as the atoms in a buddha realm.

source: མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་གང་ན་བ་དེར་ཐལ་མོ་སྦྱར་ཏེ། བཏུད་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: With his upper robe removed from one shoulder and with his palms together, he bowed in the direction of the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā and recited these verses:

source: །དེ་ནི་བདག་གི་སེམས་ལ་བདག་དགོངས་ཏེ།
en: “I regard my own mind and my aspiration

source: །བྱང་ཆུབ་མོས་པ་མྱི་ལྡོག་ཤིན་ཏུ་བརྟན།
en: To enlightenment to be firm and irreversible.

source: །ཁྱོད་ཀྱི་ཐུགས་ལའང་བདག་ནི་དེ་བཞིན་དུ།
en: As it is in your mind, so it is in mine.

source: །བདག་གི་བཞིན་དུ་དེ་རིང་བརྟན་པར་སྐྱེས།
en: And that which is mine has today become firm.

source: །སྡིག་ཏོ་མ་ལུས་རྣམ་པར་བྱང་བར་གྱུར།
en: “I have been purified of everything that is sinful;

source: །དགེ་བའི་རྣམ་སྨིན་མི་མཉམ་བར་ཏུ་ཐོབ།
en: I have attained the unequaled ripening of good karma.

source: །བདག་གིས་ལྟ་ན་མཛེས་པ་ཁྱོད་མཐོང་བས།
en: When I look and see you, beautiful one,

source: །ཆོས་དཀར་མི་ངས་བདག་གིས་ཡོངས་སུ་བསྩགས།
en: I accumulate inexhaustible good qualities.

source: །བདག་གི་སེམས་ནི་ཡོན་ཏན་ཆུ་བོས་བརྒྱན།
en: “My mind is adorned by a river of qualities.

source: །སེམས་ཅན་ཕན་བརྩོན་རྣམ་པ་ཐ་དད་པས།
en: Through dedication to benefiting beings in various ways,

source: །བརྒྱན་གྱུར་དེས་ནི་ཕྱི་མཐའི་བསྐལ་པར་ཡང་།
en: I practice a conduct that is thus adorned

source: །ཞིང་རྣམས་ཀུན་ཏུ་སྤྱོད་པ་སྤྱད་པར་བགྱི།
en: Within all realms until the last of future kalpas.

source: །འཕགས་མས་བདག་ལ་ཐུགས་བརྩེ་མཛད་སླད་དུ།
en: “Āryā, in order to show your kindness to me,

source: །ཆོས་རྣམས་ཐམས་ཅད་གྲུབ་པ་ཁྱོད་ཀྱིས་བསྟན།
en: You have revealed the accomplishment of all Dharmas.

source: །བདག་ལ་སྨན་སླད་རྗེས་སུ་གཟུང་དགོངས་ཏེ།
en: I pray that for my benefit you will decide to care for me

source: །ཆོས་ཀྱི་གདམས་ངག་དམ་པ་སྩལ་དུ་གསོལ།
en: And bestow on me the highest teaching of the Dharma.

source: །ངན་འགྲོར་ལྷུང་བའི་ལམ་ནི་རྣམ་པར་བཟློག།
en: “You have repelled the path of falling into lower existences.

source: །མཐོ་རིས་ཤུལ་གཙང་དམ་པ་ཡོངས་སུ་བསྟན། །བདེ་གཤེགས་མ་ལུས་བཞུད་ཅིང་རྗེས་བཞུད་པའི།
en: You have shown the pure path to the higher existences.

source: །ཐམས་ཅད་མཁྱེན་པའི་ཤུལ་ཀྱང་ཁྱོད་ཀྱིས་བསྟན།
en: You have taught the path to omniscience, Which is the way followed by every sugata.

source: །དཔེ་མེད་རྨད་དུ་བྱུང་མངའ་ཁྱོད་ལ་བདག །འབྱུང་བའི་འདུ་ཤེས་དམ་པ་ཉེ་བར་སྐྱེས།
en: “Incomparable, marvelous one, I have in your presence Developed the supreme conception of setting forth. The pure entranceway to the Dharma of omniscience

source: །ནམ་མཁའ་ལྟ་བུར་དྲི་མེད་ཚད་མྱེད་པའི། །ཐམས་ཅད་མཁྱེན་ཉིད་ཆོས་སྒོ་རྣམ་པར་དག །ཀུན་མཁྱེན་ཚད་མྱེད་འབྱུང་གནས་བཟང་པོ་ཡི།
en: Is immeasurable and stainless, like space.

source: །འདུ་ཤེས་དེ་རིང་ཚད་མེད་ཁྱོད་ལ་སྐྱེས།
en: “Today I have developed the immeasurable perception of you As the excellent source of immeasurable omniscience.

source: །བསོད་ནམས་རྒྱ་མཚོ་མཁའ་ལྟར་ཚད་མེད་པའི།
en: An ocean of merit as immeasurable as space

source: །སེམས་ལས་བྱུང་བ་སྐད་ཅིག་རེ་རེར་འབྱུང་།
en: Arises in the mind with every instant.

source: །འཕགས་མ་ཕ་རོལ་ཕྱིན་པས་བདག་བཀུར་གསོལ།
en: “Āryā, I pray you empower me with the perfections.

source: །བསམ་ཡས་བསོད་ནམས་ཀྱིས་ཀྱང་རྣམ་སྤེལ་གསོལ།
en: I pray that you augment inconceivable merit.

source: །ཡོན་ཏན་དགེ་བ་ཐམས་ཅད་ཡོངས་འཕེལ་ནས།
en: Having augmented all goodness and qualities,

source: །ཐམས་ཅད་མཁྱེན་པའི་གོ་འཕང་མྱུར་ཐོབ་མཛོད།
en: Cause me to quickly attain the level of omniscience.

source: །དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་རྟག་པར་དགའ།
en: “I constantly perceive the kalyāṇamitras

source: །ཐམས་ཅད་མཁྱེན་ལམ་རབ་རྫོགས་འདུ་ཤེས་ཏེ།
en: As the complete path to omniscience.

source: །དེ་ཡི་སླད་དུ་བདག་གི་ཆོས་དཀར་རྣམས།
en: Therefore they will be made content

source: །མྱུར་དུ་རྫོགས་པར་འགྱུར་ཞེས་ཚིམ་པར་གྱུར།
en: By my quickly perfecting all good qualities.

source: །དེ་སླད་འདི་ལས་དོན་ཀུན་རབ་ཏུ་བྱུང་།
en: “Therefore, from this come all benefits

source: །དགེ་བའི་ཡོན་ཏན་ལྡན་པ་གྲུབ་པར་གྱུར།
en: And the accomplishment of good qualities.

source: །བརྗོད་པ་མཐའ་ཡས་ཐམས་ཅད་མཁྱེན་པའི་ལམ།
en: I shall accomplish this path to omniscience

source: །འདི་ནི་ཡོངས་སུ་བསྒྲུབས་ཤིང་འགྲོ་ལ་བརྗོད།
en: And proclaim it to beings through infinite praises.

source: །ཡོན་ཏན་ཚད་མེད་ཁྱོད་ནི་སློབ་དཔོན་གྱུར།
en: “You are my teacher of immeasurable qualities.

source: །ཐམས་ཅད་མཁྱེན་ཀྱི་ཆོས་ལ་བདག་འདྲེན་པ།
en: You are my guide toward the qualities of omniscience.

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་གྲངས་མེད་པས།
en: Āryā, even in countless quintillions of kalpas

source: །འཕགས་མ་ཁྱོད་ལ་བདག་གིས་ལན་མི་ལོན།
en: I will not be able to repay your kindness.”

source: །དེ་ནས་ཚོང་དཔོན་ནོར་བཟངས་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་ནས། མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་ཁྱོད་ཀྱིས་བདག་ལ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་ནི་བསྟན་ན་ལྷ་མོ་རྣམ་པར་ཐར་བ་འདིའི་མིང་ནི་ཅི་ཞེས་བགྱི།
en: Then Sudhana, the head merchant’s son, having recited those verses, said to the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā, “Goddess, if you teach me this inconceivable scope of your bodhisattva liberation, then, goddess, what is the name of this liberation?

source: ལྷ་མོ་ཁྱོད་ནི་ཅི་སྲིད་ཅིག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱུང་ཆུབ་ཏུ་ཞུགས་ཇི་སྲིད་ཅིག་ན་ནི་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་འགྱུར།
en: Goddess, how long has it been since you entered upon attaining the highest, complete enlightenment? How long will it be before you attain the highest, complete enlightenment of buddhahood?”
